import type { Cat } from '../components/JokeCats';

const catsdata: Cat[] = [
  {
    cat: 'Разни',
    count: 16276,
  },
  {
    cat: 'Жени',
    count: 11697,
  },
  {
    cat: 'Семейни',
    count: 8741,
  },
  {
    cat: 'Бисери',
    count: 8392,
  },
  {
    cat: 'Мръсни',
    count: 3409,
  },
  {
    cat: 'Блондинки',
    count: 3355,
  },
  {
    cat: 'Професионални',
    count: 3098,
  },
  {
    cat: 'Животни',
    count: 2949,
  },
  {
    cat: 'Програмисти',
    count: 2653,
  },
  {
    cat: 'Любими Герои',
    count: 2586,
  },
  {
    cat: 'Черен хумор',
    count: 2138,
  },
  {
    cat: 'Политически',
    count: 2083,
  },
  {
    cat: 'Полицаи',
    count: 1734,
  },
  {
    cat: 'Борци',
    count: 1562,
  },
  {
    cat: 'Иванчо и Марийка',
    count: 1538,
  },
  {
    cat: 'Деца',
    count: 1521,
  },
  {
    cat: 'Пиянски',
    count: 1512,
  },
  {
    cat: 'Младоженци',
    count: 1303,
  },
  {
    cat: 'Проститутки',
    count: 1268,
  },
  {
    cat: 'Америка',
    count: 1213,
  },
  {
    cat: 'Лекари',
    count: 1202,
  },
  {
    cat: 'Градове',
    count: 1197,
  },
  {
    cat: 'Цигани',
    count: 1186,
  },
  {
    cat: 'Дядовци',
    count: 1183,
  },
  {
    cat: 'Глупави',
    count: 1100,
  },
  {
    cat: 'Надписи',
    count: 1088,
  },
  {
    cat: 'Фармацевти',
    count: 1077,
  },
  {
    cat: 'Подаръци',
    count: 1063,
  },
  {
    cat: 'Обратни',
    count: 1020,
  },
  {
    cat: 'Щерки',
    count: 1012,
  },
  {
    cat: 'Каква е разликата',
    count: 1010,
  },
  {
    cat: 'Монаси',
    count: 1003,
  },
  {
    cat: 'Иванчо',
    count: 990,
  },
  {
    cat: 'Катаджии',
    count: 986,
  },
  {
    cat: 'Командировки',
    count: 984,
  },
  {
    cat: 'Евреи',
    count: 982,
  },
  {
    cat: 'Изпити',
    count: 972,
  },
  {
    cat: 'Цигари',
    count: 960,
  },
  {
    cat: 'Вино',
    count: 959,
  },
  {
    cat: 'Адвокати',
    count: 958,
  },
  {
    cat: 'Гинеколози',
    count: 956,
  },
  {
    cat: 'Младежи',
    count: 952,
  },
  {
    cat: 'Влакове',
    count: 950,
  },
  {
    cat: 'Плажове',
    count: 945,
  },
  {
    cat: 'Професори',
    count: 940,
  },
  {
    cat: 'Шофьори',
    count: 937,
  },
  {
    cat: 'Мутри',
    count: 909,
  },
  {
    cat: 'Прасета',
    count: 908,
  },
  {
    cat: 'Съседи',
    count: 895,
  },
  {
    cat: 'Рожденици',
    count: 891,
  },
  {
    cat: 'Гейове',
    count: 887,
  },
  {
    cat: 'Фейсбук',
    count: 887,
  },
  {
    cat: 'Директори',
    count: 886,
  },
  {
    cat: 'София',
    count: 876,
  },
  {
    cat: 'Любовник',
    count: 869,
  },
  {
    cat: 'Празнични',
    count: 862,
  },
  {
    cat: 'Други',
    count: 860,
  },
  {
    cat: 'Келнери',
    count: 850,
  },
  {
    cat: 'Тоалетна',
    count: 840,
  },
  {
    cat: 'Умрели',
    count: 839,
  },
  {
    cat: 'Спортни',
    count: 838,
  },
  {
    cat: 'Секретарки',
    count: 830,
  },
  {
    cat: 'Студентски',
    count: 829,
  },
  {
    cat: 'Огледало',
    count: 821,
  },
  {
    cat: 'Затворници',
    count: 804,
  },
  {
    cat: 'Дебели',
    count: 787,
  },
  {
    cat: 'Бебета',
    count: 779,
  },
  {
    cat: 'Радио ереван',
    count: 773,
  },
  {
    cat: 'Лято',
    count: 757,
  },
  {
    cat: 'Крави',
    count: 753,
  },
  {
    cat: 'Маса',
    count: 751,
  },
  {
    cat: 'Чък Норис',
    count: 733,
  },
  {
    cat: 'Зима',
    count: 730,
  },
  {
    cat: 'Тъщи',
    count: 729,
  },
  {
    cat: 'Ракия',
    count: 727,
  },
  {
    cat: 'Психиатрия',
    count: 712,
  },
  {
    cat: 'Русия',
    count: 708,
  },
  {
    cat: 'Грозни',
    count: 696,
  },
  {
    cat: 'Кръчми',
    count: 690,
  },
  {
    cat: 'Храна',
    count: 689,
  },
  {
    cat: 'Гардероби',
    count: 689,
  },
  {
    cat: 'Любовница',
    count: 689,
  },
  {
    cat: 'Купони',
    count: 669,
  },
  {
    cat: 'Уиски',
    count: 666,
  },
  {
    cat: 'Принцове и принцеси',
    count: 664,
  },
  {
    cat: 'Наркомански',
    count: 661,
  },
  {
    cat: 'Доктори',
    count: 660,
  },
  {
    cat: 'Перничани',
    count: 649,
  },
  {
    cat: 'Хотели',
    count: 643,
  },
  {
    cat: 'Банки',
    count: 641,
  },
  {
    cat: 'Дискотеки',
    count: 640,
  },
  {
    cat: 'Плуване',
    count: 635,
  },
  {
    cat: 'Ресторанти',
    count: 632,
  },
  {
    cat: 'Усмивки',
    count: 631,
  },
  {
    cat: 'Дядо Мраз',
    count: 625,
  },
  {
    cat: 'Нова година',
    count: 624,
  },
  {
    cat: 'Китай',
    count: 620,
  },
  {
    cat: 'Мъже',
    count: 617,
  },
  {
    cat: 'Марийка',
    count: 612,
  },
  {
    cat: 'Обувки',
    count: 612,
  },
  {
    cat: 'Готвачи',
    count: 605,
  },
  {
    cat: 'Отслабване',
    count: 603,
  },
  {
    cat: 'Франция',
    count: 601,
  },
  {
    cat: 'Кокошки',
    count: 598,
  },
  {
    cat: 'Такси',
    count: 596,
  },
  {
    cat: 'Слонове',
    count: 595,
  },
  {
    cat: 'Mercedes',
    count: 592,
  },
  {
    cat: 'Петък',
    count: 589,
  },
  {
    cat: 'Хляб',
    count: 584,
  },
  {
    cat: 'Овчари',
    count: 584,
  },
  {
    cat: 'SMS',
    count: 584,
  },
  {
    cat: 'Хасан и Айшето',
    count: 580,
  },
  {
    cat: 'Филми',
    count: 575,
  },
  {
    cat: 'Сутиени',
    count: 574,
  },
  {
    cat: 'Маймуни',
    count: 573,
  },
  {
    cat: 'Математика',
    count: 570,
  },
  {
    cat: 'Планина',
    count: 570,
  },
  {
    cat: 'Бойко Борисов',
    count: 567,
  },
  {
    cat: 'Обяд',
    count: 566,
  },
  {
    cat: 'Професии',
    count: 556,
  },
  {
    cat: 'Свалки',
    count: 555,
  },
  {
    cat: 'Водка',
    count: 554,
  },
  {
    cat: 'Ученически',
    count: 548,
  },
  {
    cat: 'Шоколад',
    count: 537,
  },
  {
    cat: 'Родители',
    count: 526,
  },
  {
    cat: 'Сервитьори',
    count: 526,
  },
  {
    cat: 'Кредити',
    count: 522,
  },
  {
    cat: 'Супи',
    count: 518,
  },
  {
    cat: 'Сватба',
    count: 508,
  },
  {
    cat: 'Капитани',
    count: 502,
  },
  {
    cat: 'Съдии',
    count: 500,
  },
  {
    cat: 'Морето',
    count: 493,
  },
  {
    cat: 'Ядене',
    count: 492,
  },
  {
    cat: 'Котки',
    count: 491,
  },
  {
    cat: 'Умни',
    count: 477,
  },
  {
    cat: 'Японци',
    count: 465,
  },
  {
    cat: 'С*кс',
    count: 450,
  },
  {
    cat: 'Началници',
    count: 442,
  },
  {
    cat: 'Радио Ереван',
    count: 440,
  },
  {
    cat: 'Футбол',
    count: 422,
  },
  {
    cat: 'Шефове',
    count: 419,
  },
  {
    cat: 'Сутрин',
    count: 395,
  },
  {
    cat: 'Татковци',
    count: 330,
  },
  {
    cat: 'Тъпизми',
    count: 330,
  },
  {
    cat: 'Военни',
    count: 326,
  },
  {
    cat: 'Телефони',
    count: 322,
  },
  {
    cat: 'Телевизия',
    count: 291,
  },
  {
    cat: 'Кухня',
    count: 282,
  },
  {
    cat: 'Гадории',
    count: 274,
  },
  {
    cat: 'Интернет',
    count: 270,
  },
  {
    cat: 'Бай Ганьо',
    count: 268,
  },
  {
    cat: 'България',
    count: 261,
  },
  {
    cat: 'Кучета',
    count: 257,
  },
  {
    cat: 'Заплати',
    count: 255,
  },
  {
    cat: 'Авто',
    count: 247,
  },
  {
    cat: 'Изневери',
    count: 228,
  },
  {
    cat: 'Бира',
    count: 225,
  },
  {
    cat: 'Брюнетки',
    count: 201,
  },
  {
    cat: 'Баби',
    count: 191,
  },
  {
    cat: 'Подсъдими',
    count: 189,
  },
  {
    cat: 'Луди',
    count: 189,
  },
  {
    cat: 'Чукчи',
    count: 188,
  },
  {
    cat: 'В ресторанта',
    count: 173,
  },
  {
    cat: 'Герои',
    count: 164,
  },
  {
    cat: 'Джипове',
    count: 143,
  },
  {
    cat: 'Поручик Ржевски',
    count: 131,
  },
  {
    cat: 'Генко',
    count: 130,
  },
  {
    cat: 'Червената шапчица',
    count: 130,
  },
  {
    cat: 'Щирлиц',
    count: 127,
  },
  {
    cat: 'Пари',
    count: 126,
  },
  {
    cat: 'Комунистически',
    count: 120,
  },
  {
    cat: 'Кафе',
    count: 119,
  },
  {
    cat: 'Ловци',
    count: 119,
  },
  {
    cat: 'Служители',
    count: 116,
  },
  {
    cat: 'Жаби',
    count: 113,
  },
  {
    cat: 'Нане и Вуте',
    count: 111,
  },
  {
    cat: 'Дъщери',
    count: 106,
  },
  {
    cat: 'Приятели',
    count: 105,
  },
  {
    cat: 'Чапай и Петка',
    count: 102,
  },
  {
    cat: 'Комар',
    count: 101,
  },
  {
    cat: 'Африка',
    count: 96,
  },
  {
    cat: 'Петка и Чапаев',
    count: 93,
  },
  {
    cat: 'Варна',
    count: 92,
  },
  {
    cat: 'Пожелания',
    count: 89,
  },
  {
    cat: 'Годеници',
    count: 89,
  },
  {
    cat: 'Златната рибка',
    count: 88,
  },
  {
    cat: 'Зъболекари',
    count: 85,
  },
  {
    cat: 'Расистки',
    count: 84,
  },
  {
    cat: 'Мечо Пух',
    count: 84,
  },
  {
    cat: 'Пътуване',
    count: 82,
  },
  {
    cat: 'Габровски',
    count: 80,
  },
  {
    cat: 'Митничари',
    count: 77,
  },
  {
    cat: 'Бърза помощ',
    count: 76,
  },
  {
    cat: 'Майки',
    count: 75,
  },
  {
    cat: 'Знаете ли че',
    count: 72,
  },
  {
    cat: 'Зетьове',
    count: 72,
  },
  {
    cat: 'Англия',
    count: 72,
  },
  {
    cat: 'Канибали',
    count: 71,
  },
  {
    cat: 'Журналисти',
    count: 70,
  },
  {
    cat: 'Депутати',
    count: 68,
  },
  {
    cat: 'Синове',
    count: 66,
  },
  {
    cat: 'Данъчни',
    count: 66,
  },
  {
    cat: 'Германия',
    count: 63,
  },
  {
    cat: 'Извънземни',
    count: 63,
  },
  {
    cat: 'Индианци и Каубои',
    count: 61,
  },
  {
    cat: 'Истории',
    count: 61,
  },
  {
    cat: 'Импотентни',
    count: 60,
  },
  {
    cat: 'Крокодили',
    count: 59,
  },
  {
    cat: 'Колеги',
    count: 58,
  },
  {
    cat: 'Кино',
    count: 57,
  },
  {
    cat: 'Образованието',
    count: 53,
  },
  {
    cat: 'Рибари',
    count: 51,
  },
  {
    cat: 'Избори',
    count: 51,
  },
  {
    cat: 'Зоопарк',
    count: 50,
  },
  {
    cat: 'Свекър и свекърва',
    count: 50,
  },
  {
    cat: 'Кюфтета',
    count: 49,
  },
  {
    cat: 'Клиенти',
    count: 48,
  },
  {
    cat: 'Мравки',
    count: 47,
  },
  {
    cat: 'Негри',
    count: 46,
  },
  {
    cat: 'Щастие',
    count: 46,
  },
  {
    cat: 'Църквата',
    count: 46,
  },
  {
    cat: 'Гъбари',
    count: 45,
  },
  {
    cat: 'Змии',
    count: 45,
  },
  {
    cat: 'Медицински сестри',
    count: 45,
  },
  {
    cat: 'Магарета',
    count: 43,
  },
  {
    cat: 'Коледа и Нова година',
    count: 42,
  },
  {
    cat: 'Понеделник',
    count: 42,
  },
  {
    cat: 'Университети',
    count: 41,
  },
  {
    cat: 'Хирурзи',
    count: 40,
  },
  {
    cat: 'Джентълмени',
    count: 40,
  },
  {
    cat: 'Казарма',
    count: 37,
  },
  {
    cat: 'Смърта',
    count: 37,
  },
  {
    cat: 'Първата брачна нощ',
    count: 37,
  },
  {
    cat: 'Европа',
    count: 36,
  },
  {
    cat: 'Щъркели',
    count: 35,
  },
  {
    cat: 'Ергени',
    count: 35,
  },
  {
    cat: 'Стюардеси',
    count: 34,
  },
  {
    cat: 'Луната',
    count: 34,
  },
  {
    cat: 'Красиви',
    count: 34,
  },
  {
    cat: 'Мотори',
    count: 34,
  },
  {
    cat: 'Тока',
    count: 33,
  },
  {
    cat: 'Пролет',
    count: 33,
  },
  {
    cat: 'Риболов',
    count: 32,
  },
  {
    cat: 'Оптимисти',
    count: 32,
  },
  {
    cat: 'Продавачи',
    count: 32,
  },
  {
    cat: 'Касиери',
    count: 32,
  },
  {
    cat: 'Патки',
    count: 32,
  },
  {
    cat: 'Зайо Байо',
    count: 32,
  },
  {
    cat: 'Спин',
    count: 31,
  },
  {
    cat: 'Камиони',
    count: 30,
  },
  {
    cat: 'Парламент',
    count: 30,
  },
  {
    cat: 'Уикенд',
    count: 30,
  },
  {
    cat: 'Събота',
    count: 29,
  },
  {
    cat: 'Президентски',
    count: 28,
  },
  {
    cat: 'Пешо',
    count: 28,
  },
  {
    cat: 'Пустиня',
    count: 28,
  },
  {
    cat: 'Шерлок Хоумс',
    count: 27,
  },
  {
    cat: 'Рая и Ада',
    count: 27,
  },
  {
    cat: 'Царе',
    count: 27,
  },
  {
    cat: 'Министри',
    count: 27,
  },
  {
    cat: 'Интелигентни',
    count: 27,
  },
  {
    cat: 'Слаботелесни',
    count: 26,
  },
  {
    cat: 'Охранители',
    count: 26,
  },
  {
    cat: 'Отпускари',
    count: 25,
  },
  {
    cat: 'Майстори',
    count: 25,
  },
  {
    cat: 'Туристи',
    count: 25,
  },
  {
    cat: 'Преподаватели',
    count: 25,
  },
  {
    cat: 'Фитнес',
    count: 24,
  },
  {
    cat: 'Настроение',
    count: 24,
  },
  {
    cat: 'Обири',
    count: 24,
  },
  {
    cat: 'Бизнесмени',
    count: 24,
  },
  {
    cat: 'Папагали',
    count: 24,
  },
  {
    cat: 'Киркор и Гарабед',
    count: 23,
  },
  {
    cat: 'Работници',
    count: 23,
  },
  {
    cat: 'Селяни',
    count: 22,
  },
  {
    cat: 'Лисици',
    count: 22,
  },
  {
    cat: 'Трева',
    count: 21,
  },
];
export default catsdata;
